N, M = map(int, input().split())
board = [list(map(int, input().split())) for _ in range(N)]

# 5가지 모양의 도형에 대한 좌표값 설정 (회전한 모양 포함)
figures = [
  # ㅡ & ㅣ 모양의 도형
  [(0, 0), (0, 1), (0, 2), (0, 3)], [(0, 0), (1, 0), (2, 0), (3, 0)],
  # ㅁ 모양의 도형
  [(0, 0), (0, 1), (1, 0), (1, 1)],
  # L의 상하좌우 모양의 도형
  [(0, 0), (0, 1), (0, 2), (1, 0)], [(0, 0), (0, 1), (0, 2), (-1, 2)], [(0, 0), (1, 0), (1, 1), (1, 2)], [(0, 0), (0, 1), (0, 2), (1, 2)],
  [(0, 0), (1, 0), (2, 0), (2, 1)], [(0, 0), (1, 0), (2, 0), (2, -1)], [(0, 0), (0, 1), (1, 0), (2, 0)], [(0, 0), (0, 1), (1, 1), (2, 1)],
  # ㅜ & ㅗ & ㅏ & ㅓ 모양의 도형
  [(0, 0), (0, 1), (0, 2), (1, 1)], [(0, 0), (0, 1), (0, 2), (-1, 1)], [(0, 0), (1, 0), (1, 1), (2, 0)], [(0, 0), (1, 0), (2, 0), (1, -1)],
  # ㄹ같은 모양의 도형
  [(0, 0), (1, 0), (1, -1), (2, -1)], [(0, 0), (1, 0), (1, 1), (2, 1)], [(0, 0), (0, 1), (-1, 1), (-1, 2)], [(0, 0), (0, 1), (1, 1), (1, 2)]
]

max_ans = 0
for x in range(N):
  for y in range(M):
    for figure in figures:
      sum = 0
      for dx, dy in figure:
        nx = x + dx
        ny = y + dy
        if 0 <= nx < N and 0 <= ny < M:
          sum += board[nx][ny]
        else:
          break
      
      # 계속 최댓값 갱신해주기
      max_ans = max(sum, max_ans)

print(max_ans)